
#include"main.h"

void game_skill_p(int x,int y,int (*maze)[NN] ) //对九宫格进行边界判断 
{
	if(x>2&&y>2)
	{
		if(*(*(maze+x-1)+y-1 ) !=3 )   //判断是否为捕手，不是时才执行 
		{
			*(*(maze+x-1)+y-1 ) = 1;
			print_space( x-1,y-1);	
		}
		
	} 
	if(x>2)
	{
		if(*(*(maze+x-1)+y-1 ) !=3 )   //判断是否为捕手，不是时才执行 
		{
			*(*(maze+x-1)+y ) = 1;
			print_space( x-1,y);
		} 
	} 
	if(x>2 && y<NN-3)
	{
		if(*(*(maze+x-1)+y-1 ) !=3 )   //判断是否为捕手，不是时才执行 
		{
			*(*(maze+x-1)+y+1 ) = 1;
			print_space( x-1,y+1);
		} 
	} 
	/***********************************************************************************/
	
	if(y>2)
	{
		if(*(*(maze+x-1)+y-1 ) !=3 )   //判断是否为捕手，不是时才执行 
		{
			*(*(maze+x)+y-1 ) = 1;
			print_space( x,y-1);
		} 
	} 
	if(y<NN-3)
	{
		if(*(*(maze+x-1)+y-1 ) !=3 )   //判断是否为捕手，不是时才执行 
		{
			*(*(maze+x)+y+1 ) = 1;
			print_space( x,y+1);
		} 
	} 
	
	/***********************************************************************************/
	if(x<NN-3&&y>2)
	{
		if(*(*(maze+x-1)+y-1 ) !=3 )   //判断是否为捕手，不是时才执行 
		{
			*(*(maze+x+1)+y-1 ) = 1;
			print_space( x+1,y-1);
		} 
	} 
	if(x<NN-3)
	{
		if(*(*(maze+x-1)+y-1 ) !=3 )   //判断是否为捕手，不是时才执行 
		{
			*(*(maze+x+1)+y ) = 1;
			print_space( x+1,y);
		} 
	} 
	if(x<NN-3 && y<NN-3)
	{
		if(*(*(maze+x-1)+y-1 ) !=3 )   //判断是否为捕手，不是时才执行 
		{
			*(*(maze+x+1)+y+1 ) = 1;
			print_space( x+1,y+1);
		} 
	} 
	
//	gotoxy(40,-1);
//	color(16);
//	printf("测试已经技能释放！"); 
												
		
}


